#include "global.h"
#include "gflib.h"
#include "link.h"
#include "minigame_countdown.h"
#include "strings.h"
#include "task.h"
#include "constants/songs.h"

struct DodrioSubstruct_0160
{
    /*0x0000 : 0x3000*/ u16 ALIGNED(4) tilemapBuffers[3][BG_SCREEN_SIZE];
    /*0x3000 : 0x3160*/ bool32 finished;
    /*0x3004 : 0x3164*/ u8 ALIGNED(4) unk3004;
    /*0x3008 : 0x3168*/ u8 ALIGNED(4) unk3008[10];
    /*0x3014 : 0x3174*/ u8 ALIGNED(4) state;
    /*0x3018 : 0x3178*/ u8 ALIGNED(4) unk3018;
    /*0x301C : 0x317C*/ u16 ALIGNED(4) unk301C;
    /*0x3020 : 0x3180*/ u8 ALIGNED(4) unk3020;
    /*0x3024 : 0x3184*/ u8 ALIGNED(4) unk3024;
    /*0x3024 : 0x3184*/ void (*unk3028)(void);
}; // size = 0x302C

struct DodrioStruct_2022CF4
{
    u8 filler_00[0xc];
    u8 unkC[10];
    s16 unk16[10];
    u16 unk2A[10];
    u16 unk3E;
}; // size = 0x40

struct DodrioSubstruct_31A0_14
{
    u8 unk0[11];
    u8 unkB[11];
};

struct DodrioSubstruct_31A0_2C
{
    u8 unk0;
    u8 ALIGNED(4) unk4;
    u8 ALIGNED(4) unk8;
};

struct DodrioSubstruct_31A0
{
    u8 name[0x10];
    u32 unk10;
    struct DodrioSubstruct_31A0_14 unk14;
    struct DodrioSubstruct_31A0_2C unk2C;
    u8 filler_35[4];
}; // size = 0x3C

struct DodrioSubstruct_318C
{
    bool8 isShiny;
};

struct DodrioSubstruct_3308
{
    u8 unk0;
    u32 unk4;
};

struct DodrioStruct
{
    /*0x0000*/ void (*savedCallback)(void);
    /*0x0004*/ u8 ALIGNED(4) unk04;
    /*0x0008*/ u8 ALIGNED(4) unk08;
    /*0x000C*/ u8 ALIGNED(4) unk0C;
    /*0x0010*/ u8 ALIGNED(4) unk10;
    /*0x0014*/ u8 ALIGNED(4) unk14;
    /*0x0018*/ u8 ALIGNED(4) unk18;
    /*0x001C*/ u8 ALIGNED(4) unk1C;
    /*0x0020*/ u8 ALIGNED(4) unk20;
    /*0x0024*/ u8 ALIGNED(4) unk24;
    /*0x0028*/ u8 ALIGNED(4) multiplayerId;
    /*0x0029*/ u8 filler_0029[7];
    /*0x0030*/ u8 ALIGNED(4) unk30;
    /*0x0034*/ u8 ALIGNED(4) unk34[5];
    /*0x003C*/ u8 ALIGNED(4) unk3C;
    /*0x0040*/ u8 ALIGNED(4) unk40;
    /*0x0044*/ u8 ALIGNED(4) unk44;
    /*0x0048*/ u8 ALIGNED(4) unk48;
    /*0x004A*/ u16 unk4A[5][6];
    /*0x0086*/ u16 unk86[5];
    /*0x0090*/ u8 ALIGNED(4) unk90[5];
    /*0x0098*/ u8 ALIGNED(4) unk98[4];
    /*0x009C*/ u8 ALIGNED(4) unk9C[11];
    /*0x00A8*/ u8 ALIGNED(4) unkA8[5];
    /*0x00B0*/ u8 ALIGNED(4) unkB0[5];
    /*0x00B8*/ u8 ALIGNED(4) unkB8[11];
    /*0x00C4*/ u8 ALIGNED(4) unkC4[11];
    /*0x00D0*/ u8 ALIGNED(4) unkD0[11];
    /*0x00DC*/ u8 ALIGNED(4) unkDC[11];
    /*0x00E8*/ u8 ALIGNED(4) unkE8[11];
    /*0x00F4*/ u8 ALIGNED(4) unkF4[11][2];
    /*0x010C*/ u8 ALIGNED(4) unk10C[5];
    /*0x0112*/ u16 unk112;
    /*0x0114*/ u16 unk114;
    /*0x0118*/ u32 unk118;
    /*0x011C*/ u32 unk11C;
    /*0x0120*/ u32 unk120;
    /*0x0124*/ u8 ALIGNED(4) unk124;
    /*0x0128*/ u8 ALIGNED(4) unk128;
    /*0x012C*/ u32 unk12C;
    /*0x0130*/ u32 unk130[5];
    /*0x0144*/ u8 ALIGNED(4) unk144;
    /*0x0148*/ u8 ALIGNED(4) unk148[11];
    /*0x0154*/ u8 ALIGNED(4) unk154;
    /*0x0158*/ u8 ALIGNED(4) unk158[5];
    /*0x0160*/ struct DodrioSubstruct_0160 unk160;
    /*0x318C*/ struct DodrioSubstruct_318C unk318C[5];
    /*0x31A0*/ struct DodrioSubstruct_31A0 unk31A0[5];
    /*0x32CC*/ struct DodrioSubstruct_31A0 unk32CC;
    /*0x3308*/ struct DodrioSubstruct_3308 unk3308[5];
}; // size = 0x3330

EWRAM_DATA struct DodrioStruct * gUnknown_203F3E0 = NULL;
EWRAM_DATA u16 *gUnknown_203F3E4[5] = {NULL};
EWRAM_DATA u16 *gUnknown_203F3F8[2] = {NULL};
EWRAM_DATA u16 *gUnknown_203F400[11] = {NULL};
EWRAM_DATA u16 *gUnknown_203F42C[4] = {NULL};
EWRAM_DATA struct DodrioStruct_2022CF4 *gUnknown_203F43C = NULL;
EWRAM_DATA struct DodrioSubstruct_0160 *gUnknown_203F440 = NULL;

IWRAM_DATA bool32 gUnknown_3002044;

bool32 sub_8155E68(void);
void sub_81508D8(void);
void sub_81508EC(struct DodrioStruct * dodrio);
void sub_8150A84(u8 taskId);
void sub_8150C78(void);
void sub_8150CBC(void);
void sub_8150CF4(void);
void sub_8150D7C(void);
void sub_8150DA4(void);
void sub_8150E68(void);
void sub_8150F40(void);
void sub_8150FC4(void);
void sub_8150FDC(void);
void sub_815109C(void);
void sub_8151198(void);
void sub_81512B4(void);
void sub_8151488(void);
void sub_81514F0(void);
void sub_815159C(void);
