#include "global.h"
#include "gflib.h"
#include "easy_chat.h"
#include "event_data.h"
#include "menu.h"
#include "mevent.h"
#include "overworld.h"
#include "strings.h"
#include "task.h"
#include "constants/songs.h"
#include "constants/flags.h"

#define EZCHAT_TASK_STATE        0
#define EZCHAT_TASK_TYPE         1
#define EZCHAT_TASK_WORDS        2
#define EZCHAT_TASK_MAINCALLBACK 4
#define EZCHAT_TASK_UNK06        6
#define EZCHAT_TASK_SIZE         7

struct EasyChatScreenTemplate
{
    u8 type;
    u8 numColumns;
    u8 numRows;
    u8 frameId;
    const u8 *titleText;
    const u8 *instructionsText1;
    const u8 *instructionsText2;
    const u8 *confirmText1;
    const u8 *confirmText2;
};

struct EasyChatScreen
{
    /*0x00*/ u8 type;
    /*0x01*/ u8 templateId;
    /*0x02*/ u8 numColumns;
    /*0x03*/ u8 numRows;
    /*0x04*/ u8 state;
    /*0x05*/ s8 mainCursorColumn;
    /*0x06*/ s8 mainCursorRow;
    /*0x07*/ u8 unk_07;
    /*0x08*/ u8 stateBackup;
    /*0x09*/ u8 unk_09;
    /*0x0A*/ s8 unk_0a;
    /*0x0B*/ s8 unk_0b;
    /*0x0C*/ u8 unk_0c;
    /*0x0D*/ u8 unk_0d;
    /*0x0E*/ u8 unk_0e;
    /*0x0F*/ u8 unk_0f;
    /*0x10*/ s8 unk_10;
    /*0x11*/ s8 unk_11;
    /*0x12*/ u8 unk_12;
    /*0x14*/ u16 *words;
    /*0x18*/ u16 ecWordBuffer[9];
};

EWRAM_DATA struct EasyChatScreen *sEasyChatScreen = NULL;

void sub_80FEC0C(void);
void sub_80FEC54(u8 taskId);
void sub_80FEC90(u8 taskId);
bool8 sub_80FED80(u8 taskId);
void sub_80FEE24(MainCallback cb);
void sub_80FEF2C(void);
void sub_80FEF4C(void);
bool8 EasyChat_AllocateResources(u8 type, u16 *words);
void EasyChat_FreeResources(void);
u16 sub_80FF028(void);
u16 sub_80FF098(void);
u16 sub_80FF20C(void);
u16 sub_80FF360(void);
u16 sub_80FF41C(void);
u16 sub_80FF4A8(void);
u16 sub_80FF4F0(void);
u16 sub_80FF544(void);
u16 sub_80FF590(void);
u16 sub_80FF5A8(void);
u16 sub_80FF5C0(void);
u8 sub_80FF5F0(void);
int sub_80FF5FC(void);
int sub_80FF678(void);
int sub_80FF688(void);
int sub_80FF6B4(void);
int sub_80FF6C8(void);
void sub_80FF6F0(void);
void sub_80FF728(void);
void sub_80FF768(u16 word);
bool8 sub_80FF78C(void);
u16 sub_80FF7CC(u32 action);
int sub_80FF80C(u32 action);
int sub_80FF8D8(u32 action);
int sub_80FF968(u32 action);
