#include "global.h"
#include "gflib.h"
#include "easy_chat.h"
#include "event_data.h"
#include "menu.h"
#include "mystery_gift.h"
#include "overworld.h"
#include "strings.h"
#include "task.h"
#include "constants/songs.h"

#define EZCHAT_TASK_STATE        0
#define EZCHAT_TASK_TYPE         1
#define EZCHAT_TASK_WORDS        2
#define EZCHAT_TASK_MAINCALLBACK 4
#define EZCHAT_TASK_UNK06        6
#define EZCHAT_TASK_SIZE         7

struct EasyChatScreenTemplate
{
    u8 type;
    u8 numColumns;
    u8 numRows;
    u8 frameId;
    const u8 *titleText;
    const u8 *instructionsText1;
    const u8 *instructionsText2;
    const u8 *confirmText1;
    const u8 *confirmText2;
};

struct EasyChatScreen
{
    /*0x00*/ u8 type;
    /*0x01*/ u8 templateId;
    /*0x02*/ u8 numColumns;
    /*0x03*/ u8 numRows;
    /*0x04*/ u8 state;
    /*0x05*/ s8 mainCursorColumn;
    /*0x06*/ s8 mainCursorRow;
    /*0x07*/ u8 numWords;
    /*0x08*/ u8 stateBackup;
    /*0x09*/ bool8 isAlphaMode;
    /*0x0A*/ s8 selectGroupCursorX;
    /*0x0B*/ s8 selectGroupCursorY;
    /*0x0C*/ u8 selectGroupRowsAbove;
    /*0x0D*/ u8 selectGroupNumRows;
    /*0x0E*/ u8 selectWordRowsAbove;
    /*0x0F*/ u8 selectWordNumRows;
    /*0x10*/ s8 selectWordCursorX;
    /*0x11*/ s8 selectWordCursorY;
    /*0x14*/ u16 *words;
    /*0x18*/ u16 ecWordBuffer[9];
};

static EWRAM_DATA struct EasyChatScreen * sEasyChatScreen = NULL;

static void CB2_EasyChatScreen(void);
static void Task_InitEasyChat(u8 taskId);
static void Task_RunEasyChat(u8 taskId);
static bool8 Task_InitEasyChatInternal(u8 taskId);
static void DismantleEasyChat(MainCallback cb);
static void CompareProfileResponseWithPassphrase(void);
static void CompareQuestionnaireResponseWithPassphrase(void);
static bool8 EasyChat_AllocateResources(u8 type, u16 *words);
static void EasyChat_FreeResources(void);
static u16 EasyChatScreen_HandleJoypad(void);
static u16 HandleJoypad_SelectField(void);
static u16 HandleJoypad_SelectFooter(void);
static u16 HandleJoypad_SelectGroup(void);
static u16 HandleJoypad_SelectWord(void);
static u16 Cancel_HandleYesNoMenu(void);
static u16 Confirm_HandleYesNoMenu(void);
static u16 DelAll_HandleYesNoMenu(void);
static u16 Cancel_CreateYesNoMenu(void);
static u16 DelAll_CreateYesNoMenu(void);
