#include "global.h"
#include "decompress.h"
#include "gpu_regs.h"
#include "main.h"
#include "m4a.h"
#include "dma3.h"
#include "help_system.h"
#include "list_menu.h"
#include "sound.h"
#include "strings.h"
#include "text.h"
#include "blit.h"
#include "event_data.h"
#include "constants/songs.h"
#include "constants/flags.h"

extern u8 gGlyphInfo[];

struct DmaController
{
    void * dest;
    void * src;
    u32 size:21;
    u32 destMode:2;
    u32 srcMode:2;
    u32 repeat:1;
    u32 width:1;
    u32 dreqOn:1;
    u32 startMode:3;
    u32 intrEnable:1;
    u32 dmaEnable:1;
};

struct HelpSystemVideoState
{
    /*0x00*/ MainCallback savedVblankCb;
    /*0x04*/ MainCallback savedHblankCb;
    /*0x08*/ u16 savedDispCnt;
    /*0x0a*/ u16 savedBg0Cnt;
    /*0x0c*/ u16 savedBg0Hofs;
    /*0x0e*/ u16 savedBg0Vofs;
    /*0x10*/ u16 savedBldCnt;
    /*0x12*/ struct TextColor savedTextColor;
    /*0x15*/ u8 state;
};

void sub_813BB38(void);
void sub_813BB74(void);
void sub_813BBAC(void);
void sub_813BBC8(void);
void sub_813BBDC(void);
void sub_813BCF4(void);
void sub_813BBF4(void);
void sub_813BD14(u8);
void sub_813BF50(u8);
void sub_813BC2C(void);
void sub_813BC48(void);
void sub_813BC5C(void);
void sub_813C3AC(u8, u16, struct Bitmap *, struct Bitmap *, u8 *, u8, u8, u8, u8);
void sub_813C454(const u8 * str);
void sub_813C5D4(void);

EWRAM_DATA u8 gUnknown_203B174[BG_CHAR_SIZE] = {0};
EWRAM_DATA u8 gUnknown_203F174 = 0;
EWRAM_DATA u8 gUnknown_203F175 = 0;
EWRAM_DATA u8 gUnknown_203F176 = 0;
EWRAM_DATA u8 gUnknown_203F177 = 0;
EWRAM_DATA struct HelpSystemVideoState gUnknown_203F178 = {0};
EWRAM_DATA struct HelpSystemStruct_203F190 gUnknown_203F190 = {0};
EWRAM_DATA struct ListMenuItem gUnknown_203F1AC[52] = {0};

const u16 gUnknown_8464008[] = INCBIN_U16("graphics/help_system/unk_8464008.4bpp");
