#include "global.h"
#include "gflib.h"
#include "pokemon.h"
#include "pokemon_summary_screen.h"
#include "help_system.h"
#include "task.h"
#include "menu_helpers.h"
#include "link.h"
#include "overworld.h"
#include "constants/songs.h"
#include "strings.h"
#include "new_menu_helpers.h"
#include "menu.h"
#include "constants/species.h"
#include "constants/items.h"
#include "data.h"
#include "item.h"
#include "constants/party_menu.h"
#include "trade.h"
#include "battle_main.h"
#include "scanline_effect.h"
#include "constants/moves.h"
#include "dynamic_placeholder_text_util.h"
#include "constants/region_map_sections.h"
#include "region_map.h"
#include "field_specials.h"
#include "party_menu.h"
#include "constants/battle.h"
#include "event_data.h"
#include "trainer_pokemon_sprites.h"
#include "battle_anim.h"
#include "pokeball.h"
#include "pokemon_icon.h"
#include "battle_interface.h"
#include "mon_markings.h"
#include "pokemon_storage_system.h"

// needs conflicting header to match (curIndex is s8 in the function, but has to be defined as u8 here)
extern s16 SeekToNextMonInBox(struct BoxPokemon * boxMons, u8 curIndex, u8 maxIndex, u8 flags);

static void sub_8138B8C(struct Pokemon * mon);
static void sub_8135C34(void);
static void sub_813B784(void);
static void sub_8138414(u8 curPageIndex);
static void sub_8134BAC(u8 taskId);
static void sub_8134E84(u8 taskId);
static void sub_813B3F0(u8 taskId);
static void sub_813B120(u8, s8);
static void sub_8137E64(u8 taskId);

static void sub_8135514(void);
static u8 sub_81357A0(u8);
static void sub_8138440(void);
static void sub_8138CD8(u8 taskId);
static void sub_8135AA4(void);
static void sub_8135B90(void);
static void sub_8138538(void);
static void sub_8137D28(u8 curPageIndex);
static void sub_8136F4C(void);
static void sub_81374E8(void);
static void sub_8137BD0(void);
static void sub_8138A38(void);
static void sub_8136DA4(const u8 * str);
static void sub_8136DF0(const u8 * str);
static void sub_8136E50(const u8 * str);
static void sub_81358DC(u8, u8);
static void sub_813A838(u8 invisible);
static void sub_813AB70(u8 invisible);
static void sub_8139C44(u8 invisible);
static void sub_813B084(u8 invisible);
static void sub_8139D54(u8 invisible);
static void sub_813A3B8(u8 invisible);
static void sub_813ACF8(u8 invisible);
static void sub_813AEB0(u8 invisible);
static void sub_813A0E8(u8 invisible);
static void sub_8139EE4(u8 invisible);
static void sub_81381AC(void);
static void sub_8136BC4(void);
static void sub_8136BAC(void);
static u8 sub_8135F20(void);
static u8 sub_8136AEC(void);
static void sub_81381D0(void);
static u8 sub_8136040(void);
static void sub_8137E28(void);
static void sub_81381C0(void);
static void sub_8136D54(void);
static void sub_81360D4(void);
static void sub_8136350(void);
static void sub_81367B0(void);
static u8 sub_8138C5C(u32 status);
static void sub_81367E8(u8);
static u16 sub_8138BEC(struct Pokemon * mon, u8 moveSlot);
static u16 sub_8138C24(struct Pokemon * mon, u8 moveSlot);
static void sub_813ADA8(u16, u16);
static void sub_813ABAC(u16, u16);
static void sub_813AFFC(void);
static void sub_8139F64(u16, u16);
static void sub_813A254(u16, u16);
static void sub_813A45C(u16, u16);
static void sub_813A874(u16, u16);
static void sub_8139CB0(void);
static void sub_8139DBC(void);
static void sub_813995C(void);
static void sub_81393D4(u8 taskId);
static void sub_8137EE8(void);
static void sub_8136FB0(void);
static void sub_81370EC(void);
static void sub_8137270(void);
static void sub_81372E4(u8 i);
static void sub_8137554(void);
static void sub_8137A90(void);
static void sub_8137AF8(void);
static void sub_8137944(void);
static void sub_8137970(void);
static bool32 sub_813B838(u8 metLocation);
static bool32 sub_8138B4C(void);
static bool32 sub_813B7E0(u8 nature);
static void sub_8137724(void);
static bool32 sub_813B7F8(void);
static u8 sub_813847C(struct Pokemon * mon);
static void sub_8137C18(void);
static void sub_8137C90(void);
static void sub_813AF90(void);
static void sub_81380F0(void);
static void sub_81390B0(void);
static void sub_81391EC(void);
static void sub_8139328(struct Pokemon * mon);
static void sub_8139AAC(u16 spriteId);
static void sub_813A124(struct Sprite * sprite);
static void sub_813A35C(void);
static void sub_813A620(void);
static void sub_813A994(void);
static void sub_813ACB4(void);
static void sub_813AF50(void);
static void sub_813B068(void);
static void sub_813B0E4(void);
static s8 sub_813B20C(s8);
static s8 sub_813B38C(s8);

struct PokemonSummaryScreenData
{
    u16 unk0[0x800];
    u16 unk1000[0x800];
    u16 unk2000[0x800];
    u8 ALIGNED(4) unk3000[7];

    u8 ALIGNED(4) unk3008;
    u8 ALIGNED(4) unk300C;
    u8 ALIGNED(4) unk3010;
    u8 ALIGNED(4) unk3014;

    u8 ALIGNED(4) unk3018;
    u8 ALIGNED(4) unk301C;

    u8 ALIGNED(4) unk3020;

    bool32 isEnemyParty; /* 0x3024 */

    struct PokeSummary
    {
        u8 ALIGNED(4) unk3028[POKEMON_NAME_LENGTH];
        u8 ALIGNED(4) unk3034[POKEMON_NAME_LENGTH + 1];
        u8 ALIGNED(4) unk3040[12];
        u8 ALIGNED(4) unk304C[2][12];

        u8 ALIGNED(4) unk3064[5];
        u8 ALIGNED(4) unk306C[7];
        u8 ALIGNED(4) unk3074[ITEM_NAME_LENGTH + 1];

        u8 ALIGNED(4) unk3084[3];
        u8 ALIGNED(4) unk3088[7];
        u8 ALIGNED(4) unk3090[9];
        u8 ALIGNED(4) unk309C[5][5];

        u8 ALIGNED(4) unk30B8[5][11];
        u8 ALIGNED(4) unk30F0[5][11];
        u8 ALIGNED(4) unk3128[5][MOVE_NAME_LENGTH + 1];
        u8 ALIGNED(4) unk316C[5][5];
        u8 ALIGNED(4) unk3188[5][5];

        u8 ALIGNED(4) unk31A4[9];
        u8 ALIGNED(4) unk31B0[9];

        u8 ALIGNED(4) unk31BC[13];
        u8 ALIGNED(4) unk31CC[52];
    } summary;

    u8 ALIGNED(4) isEgg; /* 0x3200 */
    u8 ALIGNED(4) isBadEgg; /* 0x3204 */

    u8 ALIGNED(4) mode; /* 0x3208 */
    u8 ALIGNED(4) unk320C; /* 0x320C */
    u8 ALIGNED(4) lastIndex; /* 0x3210 */
    u8 ALIGNED(4) curPageIndex; /* 0x3214 */
    u8 ALIGNED(4) unk3218; /* 0x3218 */
    u8 ALIGNED(4) isBoxMon; /* 0x321C */
    u8 ALIGNED(4) unk3220[2]; /* 0x3220 */

    u8 ALIGNED(4) unk3224; /* 0x3224 */
    u8 ALIGNED(4) unk3228; /* 0x3228 */
    u8 ALIGNED(4) unk322C; /* 0x322C */
    u8 ALIGNED(4) unk3230; /* 0x3230 */

    u8 ALIGNED(4) lockMovesFlag; /* 0x3234 */

    u8 ALIGNED(4) unk3238; /* 0x3238 */
    u8 ALIGNED(4) unk323C; /* 0x323C */
    u8 ALIGNED(4) unk3240; /* 0x3240 */
    u8 ALIGNED(4) unk3244; /* 0x3244 */
    u8 ALIGNED(4) unk3248; /* 0x3248 */
    s16 ALIGNED(4) unk324C; /* 0x324C */

    u16 unk3250[5]; /* 0x3250 */
    u16 unk325A[5]; /* 0x325A */
    u8 ALIGNED(4) unk3264; /* 0x3264 */
    u8 ALIGNED(4) unk3268; /* 0x3268 */

    u8 ALIGNED(4) unk326C; /* 0x326C */

    u8 ALIGNED(4) state3270; /* 0x3270 */
    u8 ALIGNED(4) unk3274; /* 0x3274 */
    u8 ALIGNED(4) unk3278; /* 0x3278 */
    u8 ALIGNED(4) unk327C; /* 0x327C */
    u8 ALIGNED(4) unk3280; /* 0x3280 */
    u8 ALIGNED(4) unk3284; /* 0x3284 */
    u8 ALIGNED(4) unk3288; /* 0x3288 */
    u8 ALIGNED(4) unk328C; /* 0x328C */

    struct Pokemon currentMon; /* 0x3290 */

    union
    {
        struct Pokemon * mons;
        struct BoxPokemon * boxMons;
    } monList;

    MainCallback savedCallback;
    struct Sprite * markingSprite;

    u8 ALIGNED(4) unk3300[2]; /* 0x3300 */
    u8 ALIGNED(4) unk3304[3]; /* 0x3304 */
};

struct Struct203B144
{
    u16 unk00;
    u16 unk02;
    u16 unk04;
    u16 unk06;
    u16 unk08;
    u16 unk0A;
    u16 unk0C;
    u16 unk0E;
    u16 unk10;

    u16 unk12[5];
    u16 unk1C[5];

    u16 unk26;
};

struct Struct203B160
{
    struct Sprite * sprites[11]; /* 0x00 */
    u16 unk2C[11]; /* 0x2c */
    u16 unk42; /* 0x42 */
    u16 unk44; /* 0x44 */
};

struct Struct203B15C
{
    struct Sprite * sprites[10]; /* 0x00 */
    u16 unk28[10]; /* 0x28 */
    u16 unk3C; /* 0x3c */
    u16 unk3E; /* 0x3e */
};

struct Struct203B170
{
    u8 ALIGNED(4) unk00; /* 0x00 */
    u8 ALIGNED(4) unk04; /* 0x04 */
    u8 ALIGNED(4) unk08; /* 0x08 */
};

struct Struct203B148
{
    struct Sprite * sprite; /* 0x00 */
    u16 unk04; /* 0x04 */
    u16 unk06; /* 0x06 */
    u16 unk08; /* 0x08 */
};

struct Struct203B158
{
    struct Sprite * sprite; /* 0x00 */
    u16 unk04; /* 0x04 */
    u16 unk06; /* 0x06 */
};

struct Struct203B164
{
    struct Sprite * sprite; /* 0x00 */
    u16 unk04; /* 0x04 */
    u16 unk06; /* 0x06 */
};

struct Struct203B168
{
    struct Sprite * sprite; /* 0x00 */
    u16 unk04; /* 0x04 */
    u16 unk06; /* 0x06 */
};

static EWRAM_DATA struct PokemonSummaryScreenData * sMonSummaryScreen = NULL;
static EWRAM_DATA struct Struct203B144 * sUnknown_203B144 = NULL;
static EWRAM_DATA struct Struct203B148 * sUnknown_203B148[4] = {};
static EWRAM_DATA struct Struct203B158 * sUnknown_203B158 = NULL;
static EWRAM_DATA struct Struct203B15C * sUnknown_203B15C = NULL;
static EWRAM_DATA struct Struct203B160 * sUnknown_203B160 = NULL;
static EWRAM_DATA struct Struct203B164 * sUnknown_203B164 = NULL;
static EWRAM_DATA struct Struct203B168 * sUnknown_203B168 = NULL;
static EWRAM_DATA u8 sLastViewedMonIndex = 0;
static EWRAM_DATA u8 sUnknown_203B16D = 0;
static EWRAM_DATA u8 sUnknown_203B16E = 0;
static EWRAM_DATA struct Struct203B170 * sUnknown_203B170 = NULL;

extern const u32 gUnknown_8E9B750[];
extern const u32 gUnknown_8E9B950[];
extern const u32 gUnknown_8E9B598[];
extern const u32 gUnknown_8E9BA9C[];
extern const u32 gUnknown_8E9BBCC[];
extern const u16 gUnknown_8E9B310[];
