#include "global.h"
#include "shop.h"
#include "menu.h"
#include "data.h"
#include "list_menu.h"
#include "new_menu_helpers.h"
#include "party_menu.h"
#include "window.h"
#include "field_specials.h"
#include "field_weather.h"
#include "field_camera.h"
#include "task.h"
#include "text.h"
#include "item.h"
#include "item_menu.h"
#include "main.h"
#include "sound.h"
#include "strings.h"
#include "string_util.h"
#include "overworld.h"
#include "window.h"
#include "palette.h"
#include "field_fadetransition.h"
#include "scanline_effect.h"
#include "item_menu_icons.h"
#include "bg.h"
#include "gpu_regs.h"
#include "malloc.h"
#include "decompress.h"
#include "menu_indicators.h"
#include "field_player_avatar.h"
#include "fieldmap.h"
#include "field_map_obj.h"
#include "money.h"
#include "quest_log.h"
#include "script.h"
#include "event_data.h"
#include "constants/songs.h"
#include "constants/items.h"
#include "constants/game_stat.h"

#define t0 data[0]
#define tItemCount data[1]
#define tX data[4]
#define tItemId data[5]
#define tListTaskId data[7]

enum
{
    MART_TYPE_REGULAR = 0,
    MART_TYPE_TMHM,
    MART_TYPE_DECOR,
    MART_TYPE_DECOR2,
};

// RAM symbols
// Function Declarations
// Data Definitions

struct ShopData
{
    /*0x00*/ void (*callback)(void);
    /*0x04*/ const u16 *itemList;
    /*0x08*/ u32 itemPrice;
    /*0x0C*/ u16 selectedRow;
    /*0x0E*/ u16 scrollOffset;
    /*0x10*/ u16 itemCount;
    /*0x12*/ u16 field12;
    /*0x14*/ u16 maxQuantity;
    /*0x16*/ u16 martType:4;    // 0x1 if tm list
             u16 unk16_4:5;
             u16 itemSlot:2;
             u16 unk16_11:5;
    /*0x18*/ u16 unk18;
    //INCOMPLETE
};

struct MartHistory
{
    /*0x00*/ u32 unk0;
    /*0x04*/ u16 unk4;
    /*0x06*/ u16 unk6;
    /*0x08*/ u8 unk8;
    /*0x09*/ u8 unk9;
    /*0x0A*/ u8 unkA;
    /*0x0B*/ u8 unkB;
    /*0x0C*/ u16 unkC;
    /*0x0E*/ u8 unkE[6];
    /*0x14*/ u8 unk14;
    /*0x15*/ u8 unk15;
    /*0x16*/ u8 unk16;
    /*0x17*/ u8 unk17;
}; /* size = 0x18 */


EWRAM_DATA struct ShopData gShopData = {0};
EWRAM_DATA u8 gUnknown_2039950 = 0;    //sShopMenuWindowId

EWRAM_DATA u16 (*gUnknown_2039954)[0x400] = {0};    //gShopTilemapBuffers
EWRAM_DATA u16 (*gUnknown_2039958)[0x400] = {0};
EWRAM_DATA u16 (*gUnknown_203995C)[0x400] = {0};
EWRAM_DATA u16 (*gUnknown_2039960)[0x400] = {0};
/*
EWRAM_DATA struct ShopTilemapBuffers *gUnknown_2039954 = 0;    //gShopTilemapBuffers
EWRAM_DATA struct ShopTilemapBuffers *gUnknown_2039958 = 0;
EWRAM_DATA struct ShopTilemapBuffers *gUnknown_203995C = 0;
EWRAM_DATA struct ShopTilemapBuffers *gUnknown_2039960 = 0;
*/
EWRAM_DATA struct ListMenuItem *gUnknown_2039964 = {0};
EWRAM_DATA u8 (*gUnknown_2039968)[13] = {0};    //item strings

EWRAM_DATA s16 gUnknown_20398B4[MAP_OBJECTS_COUNT][4] = {0};    //sViewportMapObjects
EWRAM_DATA struct MartHistory gUnknown_203996C = {0};

EWRAM_DATA u8 gUnknown_2039984 = 0;

//Function Declarations
static u8 sub_809AAB0(u8 a0);
