#include "global.h"
#include "gflib.h"
#include "task.h"
#include "util.h"
#include "decompress.h"
#include "trade.h"
#include "link.h"
#include "link_rfu.h"
#include "mystery_gift.h"
#include "graphics.h"
#include "strings.h"
#include "menu.h"
#include "data.h"
#include "battle.h"
#include "script.h"
#include "event_data.h"
#include "mail.h"
#include "mail_data.h"
#include "pokeball.h"
#include "evolution_scene.h"
#include "overworld.h"
#include "field_fadetransition.h"
#include "quest_log.h"
#include "help_system.h"
#include "new_menu_helpers.h"
#include "pokedex.h"
#include "save.h"
#include "load_save.h"
#include "random.h"
#include "trade_scene.h"
#include "constants/items.h"
#include "constants/easy_chat.h"
#include "constants/songs.h"
#include "constants/region_map_sections.h"
#include "constants/moves.h"

// Values for signaling to/from the link partner
enum {
    STATUS_NONE,
    STATUS_READY,
    STATUS_CANCEL,
};

enum {
    GFXTAG_LINK_MON_GLOW = 5550,
    PALTAG_LINK_MON,
    GFXTAG_LINK_MON_SHADOW,
    TAG_UNUSED,
    GFXTAG_CABLE_END,
    PALTAG_GBA,
    GFXTAG_GBA_SCREEN,
    GFXTAG_POKEBALL,
    PALTAG_POKEBALL,
};

struct InGameTrade {
    /*0x00*/ u8 nickname[POKEMON_NAME_LENGTH + 1];
    /*0x0C*/ u16 species;
    /*0x0E*/ u8 ivs[NUM_STATS];
    /*0x14*/ u8 abilityNum;
    /*0x18*/ u32 otId;
    /*0x1C*/ u8 conditions[CONTEST_CATEGORIES_COUNT];
    /*0x24*/ u32 personality;
    /*0x28*/ u16 heldItem;
    /*0x2A*/ u8 mailNum;
    /*0x2B*/ u8 otName[11];
    /*0x36*/ u8 otGender;
    /*0x37*/ u8 sheen;
    /*0x38*/ u16 requestedSpecies;
};

struct {
    /*0x00*/ struct Pokemon tempMon; // Used as a temp variable when swapping Pokémon
    /*0x64*/ u32 timer;
    /*0x68*/ u32 monPersonalities[2];
    /*0x70*/ u8 filler_70[2];
    /*0x72*/ u8 playerFinishStatus;
    /*0x73*/ u8 partnerFinishStatus;
    /*0x74*/ u16 linkData[10];
    /*0x88*/ u8 linkTimeoutCheck1;
    /*0x89*/ u8 linkTimeoutCheck2;
    /*0x8A*/ u16 linkTimeoutTimer;
    /*0x8C*/ u16 neverRead_8C;
    /*0x8E*/ u8 monSpriteIds[2];
    /*0x90*/ u8 connectionSpriteId1; // Multi-purpose sprite ids used during the transfer sequence
    /*0x91*/ u8 connectionSpriteId2;
    /*0x92*/ u8 cableEndSpriteId;
    /*0x93*/ u8 scheduleLinkTransfer;
    /*0x94*/ u16 state;
    /*0x96*/ u8 filler_96[0xD2 - 0x96];
    /*0xD2*/ u8 releasePokeballSpriteId;
    /*0xD3*/ u8 bouncingPokeballSpriteId;
    /*0xD4*/ u16 bg2texX;
    /*0xD6*/ u16 bg2texY;
    /*0xD8*/ u16 neverRead_D8;
    /*0xDA*/ u16 neverRead_DA;
    /*0xDC*/ u16 bg2srcX;
    /*0xDE*/ u16 bg2srcY;
    /*0xE0*/ s16 bg1vofs;
    /*0xE2*/ s16 bg1hofs;
    /*0xE4*/ s16 bg2vofs;
    /*0xE6*/ s16 bg2hofs;
    /*0xE8*/ u16 sXY;
    /*0xEA*/ u16 bg2Zoom;
    /*0xEC*/ u16 bg2alpha;
    /*0xEE*/ bool8 isLinkTrade;
    /*0xF0*/ u16 monSpecies[2];
    /*0xF4*/ u16 cachedMapMusic;
    /*0xF6*/ u8 unk_F6;
    /*0xF8*/ struct QuestLogEvent_Traded questLogData;
    /*0x104*/ u8 textColor[3];
    /*0x107*/ u8 filler_107[1];
    /*0x108*/ bool8 isCableTrade;
    /*0x109*/ u8 win0left;
    /*0x10A*/ u8 win0top;
    /*0x10B*/ u8 win0right;
    /*0x10C*/ u8 win0bottom;
} static EWRAM_DATA * sTradeAnim = NULL;

static void SpriteCB_LinkMonGlow(struct Sprite *sprite);
static void SpriteCB_LinkMonGlowWireless(struct Sprite *sprite);
static void SpriteCB_LinkMonShadow(struct Sprite *sprite);
static void SpriteCB_CableEndSending(struct Sprite *sprite);
static void SpriteCB_CableEndReceiving(struct Sprite *sprite);
static void SpriteCB_GbaScreen(struct Sprite *sprite);
static void TradeAnimInit_LoadGfx(void);
static void CB2_InGameTrade(void);
static void SetTradeSequenceBgGpuRegs(u8 idx);
static void LoadTradeGbaSpriteGfx(void);
static void TradeBufferOTnameAndNicknames(void);
static u8 DoTradeAnim(void);
static u8 DoTradeAnim_Cable(void);
static u8 DoTradeAnim_Wireless(void);
static void SpriteCB_BouncingPokeball(struct Sprite *sprite);
static void SpriteCB_BouncingPokeballDepart(struct Sprite *sprite);
static void SpriteCB_BouncingPokeballDepartEnd(struct Sprite *sprite);
