#include "global.h"
#include "scanline_effect.h"
#include "palette.h"
#include "task.h"
#include "main.h"
#include "window.h"
#include "malloc.h"
#include "link.h"
#include "bg.h"
#include "sound.h"
#include "overworld.h"
#include "menu.h"
#include "text.h"
#include "event_data.h"
#include "easy_chat.h"
#include "money.h"
#include "window.h"
#include "strings.h"
#include "string_util.h"
#include "trainer_card.h"
#include "gpu_regs.h"
#include "pokedex.h"
#include "pokemon_icon.h"
#include "graphics.h"
#include "pokemon_icon.h"
#include "help_system.h"
#include "trainer_pokemon_sprites.h"
#include "new_menu_helpers.h"
#include "constants/songs.h"
#include "constants/flags.h"
#include "constants/game_stat.h"
#include "constants/vars.h"
#include "constants/species.h"

#define BADGE_COUNT 8

// Trainer Card Types
enum
{
    CARD_TYPE_FRLG,
    CARD_TYPE_EMERALD,
};

// Trainer Card Strings
enum
{
    TRAINER_CARD_STRING_NAME = 0,
    TRAINER_CARD_STRING_HOF_TIME,
    TRAINER_CARD_STRING_LINK_RECORD,
    TRAINER_CARD_STRING_WIN_LOSS,
    TRAINER_CARD_STRING_LINK_WINS,
    TRAINER_CARD_STRING_LINK_LOSSES,
    TRAINER_CARD_STRING_TRADES,
    TRAINER_CARD_STRING_TRADE_COUNT,
    TRAINER_CARD_STRING_BERRY_CRUSH,
    TRAINER_CARD_STRING_BERRY_CRUSH_COUNT,
    TRAINER_CARD_STRING_UNION_ROOM,
    TRAINER_CARD_STRING_UNION_ROOM_NUM,
    TRAINER_CARD_STRING_COUNT,
};

struct TrainerCardData
{
    /*0x0000*/ u8 taskState;
    /*0x0001*/ u8 printState;
    /*0x0002*/ u8 gfxLoadState;
    /*0x0003*/ u8 bgPalLoadState;
    /*0x0004*/ u8 var_4;
    /*0x0005*/ bool8 isLink;
    /*0x0006*/ u8 var_6;
    /*0x0007*/ u8 var_7;
    /*0x0008*/ u8 var_8;
    /*0x0009*/ bool8 allowDMACopy;
    /*0x000A*/ bool8 hasPokedex;
    /*0x000B*/ bool8 hasHofResult;
    /*0x000C*/ bool8 hasLinkResults;
    /*0x000D*/ bool8 hasBattleTowerWins;
    /*0x000E*/ u8 var_E;
    /*0x000F*/ u8 var_F;
    /*0x0010*/ bool8 hasTrades;
    /*0x0011*/ bool8 hasBadge[BADGE_COUNT];
    /*0x0019*/ u8 var_19[4][13];
    /*0x004D*/ u8 strings[TRAINER_CARD_STRING_COUNT][70];
    /*0x0395*/ u8 var_395;
    /*0x0396*/ u16 monIconPals[0x30];
    /*0x03F6*/ u8 var_3DB[0x60];
    /*0x0456*/ s8 var_456;
    /*0x0457*/ u8 cardType;
    /*0x0458*/ void (*callback2)(void);
    /*0x045C*/ struct TrainerCard trainerCard;
    /*0x04BC*/ u16 var_4BC;
    /*0x04BE*/ u8 var_4BE[0x4AE];
    /*0x096C*/ u16 var_96C[0x258];
    /*0x0E1C*/ u16 var_E1C;
    /*0x0E1E*/ u8 unk_E1E[0x4AE];
    /*0x12CC*/ u16 cardTiles[0x200];
    /*0x16CC*/ u16 bgTiles[0x100];
    /*0x18CC*/ u16 var_18CC[0x1180];
    /*0x3BCC*/ u16 bgTilemap0[0x1000];
    /*0x5BCC*/ u16 bgTilemap2[0x1000];
    /*0x7BCC*/ u16 var_7BCC;
    /*0x7BCE*/ bool8 var_7BCE;
    /*0x7BCF*/ u8 language;
}; /* size = 0x7BD0 */

// RAM
EWRAM_DATA struct TrainerCard gTrainerCards[4] = {0};
EWRAM_DATA static struct TrainerCardData *sTrainerCardDataPtr = NULL;

// Function Declaration
static void VBlankCB_TrainerCard(void);
static void HBlankCB_TrainerCard(void);
static void CB2_TrainerCard(void);
static void CloseTrainerCard(u8 taskId);
static void Task_TrainerCard(u8 taskId);
static bool8 LoadCardGfx(void);
static void CB2_InitTrainerCard(void);
static u32 GetCappedGameStat(u8 statId, u32 maxValue);
static u8 GetTrainerStarCount(struct TrainerCard *trainerCard);
static void SetPlayerCardData(struct TrainerCard *trainerCard, u8 cardType);
static void SetDataFromTrainerCard(void);
static void HandleGpuRegs(void);
static void sub_8089BD8(u16 arg0);
static void ResetGpuRegs(void);
static void TrainerCardNull(void);
static void sub_8089C5C(void);
static void sub_8089C80(void);
static void sub_8089CA4(void);
static void ResetTrainerCard(void);
